HQU-gxy/NooBot-LoraRC/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s2"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_ESP_RMAKER_OTA_AUTOFETCH=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LEDC_CTRL_FUNC_IN_IRAM=y
CONFIG_SPI_SLAVE_ISR_IN_IRAM=n
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_ESP_NETIF_LOOPBACK=y
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_ESP_WIFI_GMAC_SUPPORT=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_MBEDTLS_CRYPTO=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_LWIP_ICMP=n
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_TFT_ST7789_DRIVER=y
CONFIG_TFT_BGR_ORDER=y
CONFIG_TFT_WIDTH=172
CONFIG_TFT_HEIGHT=320
CONFIG_TFT_MISO=38
CONFIG_TFT_MOSI=37
CONFIG_TFT_SCLK=36
CONFIG_TFT_CS=35
CONFIG_TFT_DC=34
CONFIG_ENABLE_BL=n
CONFIG_TFT_LOAD_GLCD=n
CONFIG_TFT_LOAD_FONT2=n
CONFIG_TFT_LOAD_FONT4=n
CONFIG_TFT_LOAD_FONT6=n
CONFIG_TFT_LOAD_FONT7=n
CONFIG_TFT_LOAD_FONT8=n
CONFIG_TFT_LOAD_GFXFF=n
CONFIG_TFT_SMOOTH_FONT=n
CONFIG_DISABLE_WARNINGS=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_24=y
CONFIG_FMB_COMM_MODE_TCP_EN=n
CONFIG_FMB_COMM_MODE_RTU_EN=n
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=n
